<a href="https://colab.research.google.com/github/raywu60kg/kaggles/blob/master/Titanic/Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Titanic
Simple example for kaggle titanic

### 1. Load data

In [4]:
# Put our kaggle api token (kaggle.json)
from google.colab import files
uploaded = files.upload()

Saving kaggle.json to kaggle.json

In [0]:
import json
with open('kaggle.json') as f:
  kaggle_api = json.load(f)

In [0]:
import os
os.environ['KAGGLE_USERNAME'] = kaggle_api['username']
os.environ['KAGGLE_KEY'] = kaggle_api['key']

In [8]:
!kaggle competitions download -c titanic

Warning: Looks like you're using an outdated API Version, please consider updating (server 1.5.6 / client 1.5.4)
Downloading train.csv to /content
  0% 0.00/59.8k [00:00<?, ?B/s]
100% 59.8k/59.8k [00:00<00:00, 23.0MB/s]
Downloading gender_submission.csv to /content
  0% 0.00/3.18k [00:00<?, ?B/s]
100% 3.18k/3.18k [00:00<00:00, 3.21MB/s]
Downloading test.csv to /content
  0% 0.00/28.0k [00:00<?, ?B/s]
100% 28.0k/28.0k [00:00<00:00, 22.9MB/s]

## 2. Check the data

In [0]:
import pandas as pd

In [10]:
!ls

gender_submission.csv  kaggle.json  sample_data  test.csv  train.csv

In [0]:
train_data = pd.read_csv('train.csv')
test_data = pd.read_csv('test.csv')
submisstion_example = pd.read_csv('gender_submission.csv')

In [12]:
print(len(train_data))
print(train_data.columns)

891
Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [13]:
train_data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [14]:
test_data.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

## 3. Feature engineering

### 3.1 Remove some features

In [0]:
raw_train_x = train_data.drop(['PassengerId', 'Survived', 'Name', 'Ticket'], axis=1)

In [0]:
raw_test_x = test_data.drop(['PassengerId', 'Name', 'Ticket'], axis=1)

In [99]:
raw_train_x.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0       3    male  22.0      1      0   7.2500   NaN        S
1       1  female  38.0      1      0  71.2833   C85        C
2       3  female  26.0      0      0   7.9250   NaN        S
3       1  female  35.0      1      0  53.1000  C123        S
4       3    male  35.0      0      0   8.0500   NaN        S

In [100]:
raw_test_x.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0       3    male  34.5      0      0   7.8292   NaN        Q
1       3  female  47.0      1      0   7.0000   NaN        S
2       2    male  62.0      0      0   9.6875   NaN        Q
3       3    male  27.0      0      0   8.6625   NaN        S
4       3  female  22.0      1      1  12.2875   NaN        S

In [0]:
train_y = train_data['Survived']

In [33]:
train_y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

### 3.2 Parse individually

 ##### 3.2.1 Pclass

In [0]:
import numpy as np

In [101]:
print('Train data has ', sum(np.isnan(raw_train_x['Pclass'])), 'nan in Pclass.')
print('Test data has ', sum(np.isnan(raw_test_x['Pclass'])), 'nan in Pclass.')

Train data has  0 nan in Pclass.
Test data has  0 nan in Pclass.

In [0]:
train_pclass = pd.get_dummies(raw_train_x['Pclass'])
test_pclass = pd.get_dummies(raw_test_x['Pclass'])

In [113]:
train_pclass

     1  2  3
0    0  0  1
1    1  0  0
2    0  0  1
3    1  0  0
4    0  0  1
..  .. .. ..
886  0  1  0
887  1  0  0
888  0  0  1
889  1  0  0
890  0  0  1

[891 rows x 3 columns]

In [114]:
test_pclass

     1  2  3
0    0  0  1
1    0  0  1
2    0  1  0
3    0  0  1
4    0  0  1
..  .. .. ..
413  0  0  1
414  1  0  0
415  0  0  1
416  0  0  1
417  0  0  1

[418 rows x 3 columns]

##### 3.2.2 Sex

In [0]:
train_sex = pd.get_dummies(raw_train_x['Sex'])
test_sex = pd.get_dummies(raw_test_x['Sex'])

In [115]:
train_sex

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [116]:
test_sex

     female  male
0         0     1
1         1     0
2         0     1
3         0     1
4         1     0
..      ...   ...
413       0     1
414       1     0
415       0     1
416       0     1
417       0     1

[418 rows x 2 columns]

##### 3.2.3 Age

In [105]:
print('Train data has ', sum(np.isnan(raw_train_x['Age'])), 'nan in Age.')
print('Test data has ', sum(np.isnan(raw_test_x['Age'])), 'nan in Age.')

Train data has  177 nan in Age.
Test data has  86 nan in Age.

In [0]:
train_age = raw_train_x['Age'].fillna(np.mean(raw_train_x['Age']))
test_age = raw_test_x['Age'].fillna(np.mean(raw_train_x['Age']))

In [117]:
train_age

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [118]:
test_age

0      34.500000
1      47.000000
2      62.000000
3      27.000000
4      22.000000
         ...
413    29.699118
414    39.000000
415    38.500000
416    29.699118
417    29.699118
Name: Age, Length: 418, dtype: float64

##### 3.2.4 SibSp

In [107]:
print('Train data has ', sum(np.isnan(raw_train_x['SibSp'])), 'nan in SibSp.')
print('Test data has ', sum(np.isnan(raw_test_x['SibSp'])), 'nan in SibSp.')

Train data has  0 nan in SibSp.
Test data has  0 nan in SibSp.

In [0]:
train_sibsp = raw_train_x['SibSp']
test_sibsp = raw_test_x['SibSp']

In [122]:
train_sibsp

0      1
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    1
889    0
890    0
Name: SibSp, Length: 891, dtype: int64

In [123]:
test_sibsp

0      0
1      1
2      0
3      0
4      1
      ..
413    0
414    0
415    0
416    0
417    1
Name: SibSp, Length: 418, dtype: int64

##### 3.2.5 Parch

In [109]:
print('Train data has ', sum(np.isnan(raw_train_x['Parch'])), 'nan in Parch.')
print('Test data has ', sum(np.isnan(raw_test_x['Parch'])), 'nan in Parch.')

Train data has  0 nan in Parch.
Test data has  0 nan in Parch.

In [0]:
train_parch = raw_train_x['Parch']
test_parch = raw_test_x['Parch']

In [124]:
train_parch

0      0
1      0
2      0
3      0
4      0
      ..
886    0
887    0
888    2
889    0
890    0
Name: Parch, Length: 891, dtype: int64

In [125]:
test_parch

0      0
1      0
2      0
3      0
4      1
      ..
413    0
414    0
415    0
416    0
417    1
Name: Parch, Length: 418, dtype: int64

##### 3.2.6 Cabin

In [75]:
raw_train_x['Cabin']

0       NaN
1       C85
2       NaN
3      C123
4       NaN
       ...
886     NaN
887     B42
888     NaN
889    C148
890     NaN
Name: Cabin, Length: 891, dtype: object

In [0]:
tmp_cabin = []
for index in raw_train_x['Cabin']:
  if str(index) == 'nan':
    tmp_cabin.append(np.nan)
  else:
    tmp_cabin.append(str(index)[0])

In [96]:
train_cabin = pd.get_dummies(tmp_cabin, dummy_na=True)
train_cabin

     A  B  C  D  E  F  G  T  NaN
0    0  0  0  0  0  0  0  0    1
1    0  0  1  0  0  0  0  0    0
2    0  0  0  0  0  0  0  0    1
3    0  0  1  0  0  0  0  0    0
4    0  0  0  0  0  0  0  0    1
..  .. .. .. .. .. .. .. ..  ...
886  0  0  0  0  0  0  0  0    1
887  0  1  0  0  0  0  0  0    0
888  0  0  0  0  0  0  0  0    1
889  0  0  1  0  0  0  0  0    0
890  0  0  0  0  0  0  0  0    1

[891 rows x 9 columns]

In [0]:
tmp_cabin = []
for index in raw_test_x['Cabin']:
  if str(index) == 'nan':
    tmp_cabin.append(np.nan)
  else:
    tmp_cabin.append(str(index)[0])

In [129]:
test_cabin = pd.get_dummies(tmp_cabin, dummy_na=True)
test_cabin

     A  B  C  D  E  F  G  NaN
0    0  0  0  0  0  0  0    1
1    0  0  0  0  0  0  0    1
2    0  0  0  0  0  0  0    1
3    0  0  0  0  0  0  0    1
4    0  0  0  0  0  0  0    1
..  .. .. .. .. .. .. ..  ...
413  0  0  0  0  0  0  0    1
414  0  0  1  0  0  0  0    0
415  0  0  0  0  0  0  0    1
416  0  0  0  0  0  0  0    1
417  0  0  0  0  0  0  0    1

[418 rows x 8 columns]

In [137]:
# add 'T' in test
test_cabin['T'] = np.repeat(0, len(test_cabin))
test_cabin.columns

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', nan, 'T'], dtype='object')

In [138]:
columnsTitles=['A', 'B', 'C', 'D', 'E', 'F', 'G', 'T',np.nan]
test_cabin=test_cabin.reindex(columns=columnsTitles)
test_cabin

     A  B  C  D  E  F  G  T  NaN
0    0  0  0  0  0  0  0  0    1
1    0  0  0  0  0  0  0  0    1
2    0  0  0  0  0  0  0  0    1
3    0  0  0  0  0  0  0  0    1
4    0  0  0  0  0  0  0  0    1
..  .. .. .. .. .. .. .. ..  ...
413  0  0  0  0  0  0  0  0    1
414  0  0  1  0  0  0  0  0    0
415  0  0  0  0  0  0  0  0    1
416  0  0  0  0  0  0  0  0    1
417  0  0  0  0  0  0  0  0    1

[418 rows x 9 columns]

##### 3.2.7 Embarked

In [0]:
train_embarked = pd.get_dummies(raw_train_x['Embarked'], dummy_na=True)
test_embarked = pd.get_dummies(raw_test_x['Embarked'], dummy_na=True)

In [145]:
train_embarked

     C  Q  S  NaN
0    0  0  1    0
1    1  0  0    0
2    0  0  1    0
3    0  0  1    0
4    0  0  1    0
..  .. .. ..  ...
886  0  0  1    0
887  0  0  1    0
888  0  0  1    0
889  1  0  0    0
890  0  1  0    0

[891 rows x 4 columns]

In [142]:
test_embarked

     C  Q  S  NaN
0    0  1  0    0
1    0  0  1    0
2    0  1  0    0
3    0  0  1    0
4    0  0  1    0
..  .. .. ..  ...
413  0  0  1    0
414  1  0  0    0
415  0  0  1    0
416  0  0  1    0
417  1  0  0    0

[418 rows x 4 columns]

## Train Test Split

In [0]:
train_x = pd.concat([train_pclass, train_sex, train_age, train_sibsp, train_parch, train_cabin, train_embarked], axis=1)
test_x = pd.concat([test_pclass, test_sex, test_age, test_sibsp, test_parch, test_cabin, test_embarked], axis=1)

In [149]:
train_x

     1  2  3  female  male        Age  SibSp  Parch  ...  F  G  T  NaN  C  Q  S  NaN
0    0  0  1       0     1  22.000000      1      0  ...  0  0  0    1  0  0  1    0
1    1  0  0       1     0  38.000000      1      0  ...  0  0  0    0  1  0  0    0
2    0  0  1       1     0  26.000000      0      0  ...  0  0  0    1  0  0  1    0
3    1  0  0       1     0  35.000000      1      0  ...  0  0  0    0  0  0  1    0
4    0  0  1       0     1  35.000000      0      0  ...  0  0  0    1  0  0  1    0
..  .. .. ..     ...   ...        ...    ...    ...  ... .. .. ..  ... .. .. ..  ...
886  0  1  0       0     1  27.000000      0      0  ...  0  0  0    1  0  0  1    0
887  1  0  0       1     0  19.000000      0      0  ...  0  0  0    0  0  0  1    0
888  0  0  1       1     0  29.699118      1      2  ...  0  0  0    1  0  0  1    0
889  1  0  0       0     1  26.000000      0      0  ...  0  0  0    0  1  0  0    0
890  0  0  1       0     1  32.000000      0      0  ...  0  0  0    1  0  1  0    0

[891 rows x 21 columns]

In [150]:
test_x

     1  2  3  female  male        Age  SibSp  Parch  ...  F  G  T  NaN  C  Q  S  NaN
0    0  0  1       0     1  34.500000      0      0  ...  0  0  0    1  0  1  0    0
1    0  0  1       1     0  47.000000      1      0  ...  0  0  0    1  0  0  1    0
2    0  1  0       0     1  62.000000      0      0  ...  0  0  0    1  0  1  0    0
3    0  0  1       0     1  27.000000      0      0  ...  0  0  0    1  0  0  1    0
4    0  0  1       1     0  22.000000      1      1  ...  0  0  0    1  0  0  1    0
..  .. .. ..     ...   ...        ...    ...    ...  ... .. .. ..  ... .. .. ..  ...
413  0  0  1       0     1  29.699118      0      0  ...  0  0  0    1  0  0  1    0
414  1  0  0       1     0  39.000000      0      0  ...  0  0  0    0  1  0  0    0
415  0  0  1       0     1  38.500000      0      0  ...  0  0  0    1  0  0  1    0
416  0  0  1       0     1  29.699118      0      0  ...  0  0  0    1  0  0  1    0
417  0  0  1       0     1  29.699118      1      1  ...  0  0  0    1  1  0  0    0

[418 rows x 21 columns]

In [0]:
from sklearn.model_selection import train_test_split
train_x, eval_x, train_y, eval_y = train_test_split(train_x, train_y, test_size=0.2, random_state=0)

## Modeling